SpenceKonde/DxCore/megaavr/boards.txt
#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
# AVR-EA submenu options                     #
#____________________________________________#
# Chip (memory and pincount)            #
#_______________________________________#
#avrea.menu.chip.64DA28=AVR64DA28
#avrea.menu.chip.64DA28.build.mcu=avr64da28
#avrea.menu.chip.64DA28.upload.maximum_size=65536
#avrea.menu.chip.64DA28.upload.maximum_data_size=8192
#avrea.menu.chip.64DA28.build.variant=28pin-standard
#avrea.menu.chip.64DA32=AVR64DA32
#avrea.menu.chip.64DA32.build.mcu=avr64da32
#avrea.menu.chip.64DA32.upload.maximum_size=65536
#avrea.menu.chip.64DA32.upload.maximum_data_size=8192
#avrea.menu.chip.64DA32.build.variant=32pin-standard
#avrea.menu.chip.64DA48=AVR64DA48
#avrea.menu.chip.64DA48.build.mcu=avr64da48
#avrea.menu.chip.64DA48.upload.maximum_size=65536
#avrea.menu.chip.64DA48.upload.maximum_data_size=8192
#avrea.menu.chip.64DA48.build.variant=48pin-standard
#avrea.menu.chip.32DA28=AVR32DA28
#avrea.menu.chip.32DA28.build.mcu=avr32da28
#avrea.menu.chip.32DA28.upload.maximum_size=32768
#avrea.menu.chip.32DA28.upload.maximum_data_size=4096
#avrea.menu.chip.32DA28.build.variant=28pin-standard
#avrea.menu.chip.32DA32=AVR32DA32
#avrea.menu.chip.32DA32.build.mcu=avr32da32
#avrea.menu.chip.32DA32.upload.maximum_size=32768
#avrea.menu.chip.32DA32.upload.maximum_data_size=4096
#avrea.menu.chip.32DA32.build.variant=32pin-standard
#avrea.menu.chip.32DA48=AVR32DA48
#avrea.menu.chip.32DA48.build.mcu=avr32da48
#avrea.menu.chip.32DA48.upload.maximum_size=32768
#avrea.menu.chip.32DA48.upload.maximum_data_size=4096
#avrea.menu.chip.32DA48.build.variant=48pin-standard
#avrea.menu.chip.16DA28=AVR16DA28
#avrea.menu.chip.16DA28.build.mcu=avr16da28
#avrea.menu.chip.16DA28.upload.maximum_size=16384
#avrea.menu.chip.16DA28.upload.maximum_data_size=2048
#avrea.menu.chip.16DA28.build.variant=28pin-standard
#avrea.menu.chip.16DA32=AVR16DA32
#avrea.menu.chip.16DA32.build.mcu=avr16da32
#avrea.menu.chip.16DA32.upload.maximum_size=16384
#avrea.menu.chip.16DA32.upload.maximum_data_size=2048
#avrea.menu.chip.16DA32.build.variant=32pin-standard
#avrea.menu.chip.16DA48=AVR16DA48
#avrea.menu.chip.16DA48.build.mcu=avr16da48
#avrea.menu.chip.16DA48.upload.maximum_size=16384
#avrea.menu.chip.16DA48.upload.maximum_data_size=2048
#avrea.menu.chip.16DA48.build.variant=48pin-standard
#avrea.menu.chip.8DA28=AVR8DA28
#avrea.menu.chip.8DA28.build.mcu=avr8da28
#avrea.menu.chip.8DA28.upload.maximum_size=8192
#avrea.menu.chip.8DA28.upload.maximum_data_size=1024
#avrea.menu.chip.8DA28.build.variant=28pin-standard
#avrea.menu.chip.8DA32=AVR8DA32
#avrea.menu.chip.8DA32.build.mcu=avr8da32
#avrea.menu.chip.8DA32.upload.maximum_size=8192
#avrea.menu.chip.8DA32.upload.maximum_data_size=1024
#avrea.menu.chip.8EA32.build.variant=32pin-standard

#----------------------------------------#
# Clock speed and source options         #
#________________________________________#
# No information on int. osc yet    #
# this imagines it's the Dx osc     #
# and the lower clock speed is      #
# only on paper - the best case     #
# That's unlikely.                  #
#___________________________________#
#avrea.menu.clock.20internal=20 MHz internal
#avrea.menu.clock.20internal.build.f_cpu=20000000L
#avrea.menu.clock.20internal.build.speed=20
#avrea.menu.clock.20internal.build.clocksource=0
#avrea.menu.clock.16internal=16 MHz internal
#avrea.menu.clock.16internal.build.f_cpu=16000000L
#avrea.menu.clock.16internal.build.speed=16
#avrea.menu.clock.16internal.build.clocksource=0
#avrea.menu.clock.12internal=12 MHz internal
#avrea.menu.clock.12internal.build.f_cpu=12000000L
#avrea.menu.clock.12internal.build.speed=12
#avrea.menu.clock.12internal.build.clocksource=0
#avrea.menu.clock.10internal=10 MHz internal
#avrea.menu.clock.10internal.build.f_cpu=10000000L
#avrea.menu.clock.10internal.build.speed=10
#avrea.menu.clock.10internal.build.clocksource=0
#avrea.menu.clock.8internal=8 MHz internal
#avrea.menu.clock.8internal.build.f_cpu=8000000L
#avrea.menu.clock.8internal.build.speed=8
#avrea.menu.clock.8internal.build.clocksource=0
#avrea.menu.clock.4internal=4 MHz internal
#avrea.menu.clock.4internal.build.f_cpu=4000000L
#avrea.menu.clock.4internal.build.speed=4
#avrea.menu.clock.4internal.build.clocksource=0
#avrea.menu.clock.1internal=1 MHz internal
#avrea.menu.clock.1internal.build.f_cpu=1000000L
#avrea.menu.clock.1internal.build.speed=1
#avrea.menu.clock.1internal.build.clocksource=0
#avrea.menu.clock.20crystal=20 MHz crystal
#avrea.menu.clock.20crystal.build.f_cpu=20000000L
#avrea.menu.clock.20crystal.build.speed=20
#avrea.menu.clock.20crystal.build.clocksource=1
#avrea.menu.clock.16crystal=16 MHz crystal
#avrea.menu.clock.16crystal.build.f_cpu=16000000L
#avrea.menu.clock.16crystal.build.speed=16
#avrea.menu.clock.16crystal.build.clocksource=1
#avrea.menu.clock.12crystal=12 MHz crystal
#avrea.menu.clock.12crystal.build.f_cpu=12000000L
#avrea.menu.clock.12crystal.build.speed=12
#avrea.menu.clock.12crystal.build.clocksource=1
#avrea.menu.clock.8crystal=8 MHz crystal
#avrea.menu.clock.8crystal.build.f_cpu=8000000L
#avrea.menu.clock.8crystal.build.speed=8
#avrea.menu.clock.8crystal.build.clocksource=1
#avrea.menu.clock.20extclock=20 MHz ext. clock
#avrea.menu.clock.20extclock.build.f_cpu=20000000L
#avrea.menu.clock.20extclock.build.speed=20
#avrea.menu.clock.20extclock.build.clocksource=2
#avrea.menu.clock.16extclock=16 MHz ext. clock
#avrea.menu.clock.16extclock.build.f_cpu=16000000L
#avrea.menu.clock.16extclock.build.speed=16
#avrea.menu.clock.16extclock.build.clocksource=2
#avrea.menu.clock.12extclock=12 MHz ext. clock
#avrea.menu.clock.12extclock.build.f_cpu=12000000L
#avrea.menu.clock.12extclock.build.speed=12
#avrea.menu.clock.12extclock.build.clocksource=2
#avrea.menu.clock.8extclock=8 MHz ext. clock
#avrea.menu.clock.8extclock.build.f_cpu=8000000L
#avrea.menu.clock.8extclock.build.speed=8
#avrea.menu.clock.8extclock.build.clocksource=2
#avrea.menu.clock.24internal=24 MHz internal (overclocked)
#avrea.menu.clock.24internal.build.f_cpu=24000000L
#avrea.menu.clock.24internal.build.speed=24
#avrea.menu.clock.24internal.build.clocksource=0
#avrea.menu.clock.28internal=28 MHz internal (overclocked)
#avrea.menu.clock.28internal.build.f_cpu=28000000L
#avrea.menu.clock.28internal.build.speed=28
#avrea.menu.clock.28internal.build.clocksource=0
#avrea.menu.clock.32internal=32 MHz internal (overclocked)
#avrea.menu.clock.32internal.build.f_cpu=32000000L
#avrea.menu.clock.32internal.build.speed=32
#avrea.menu.clock.32internal.build.clocksource=0
#avrea.menu.clock.24crystal=24 MHz crystal (overclocked)
#avrea.menu.clock.24crystal.build.f_cpu=24000000L
#avrea.menu.clock.24crystal.build.speed=24
#avrea.menu.clock.24crystal.build.clocksource=1
#avrea.menu.clock.25crystal=25 MHz crystal (overclocked)
#avrea.menu.clock.25crystal.build.f_cpu=25000000L
#avrea.menu.clock.25crystal.build.speed=25
#avrea.menu.clock.25crystal.build.clocksource=1
#avrea.menu.clock.28crystal=28 MHz crystal (overclocked)
#avrea.menu.clock.28crystal.build.f_cpu=28000000L
#avrea.menu.clock.28crystal.build.speed=28
#avrea.menu.clock.28crystal.build.clocksource=1
#avrea.menu.clock.30crystal=30 MHz crystal (overclocked)
#avrea.menu.clock.30crystal.build.f_cpu=30000000L
#avrea.menu.clock.30crystal.build.speed=30
#avrea.menu.clock.30crystal.build.clocksource=1
#avrea.menu.clock.32crystal=32 MHz crystal (overclocked)
#avrea.menu.clock.32crystal.build.f_cpu=32000000L
#avrea.menu.clock.32crystal.build.speed=32
#avrea.menu.clock.32crystal.build.clocksource=1
#avrea.menu.clock.36crystal=36 MHz crystal (overclocked)
#avrea.menu.clock.36crystal.build.f_cpu=36000000L
#avrea.menu.clock.36crystal.build.speed=36
#avrea.menu.clock.36crystal.build.clocksource=1
#avrea.menu.clock.40crystal=40 MHz crystal (overclocked)
#avrea.menu.clock.40crystal.build.f_cpu=40000000L
#avrea.menu.clock.40crystal.build.speed=40
#avrea.menu.clock.40crystal.build.clocksource=1
#avrea.menu.clock.24extclock=24 MHz ext. clock (overclocked)
#avrea.menu.clock.24extclock.build.f_cpu=24000000L
#avrea.menu.clock.24extclock.build.speed=24
#avrea.menu.clock.24extclock.build.clocksource=2
#avrea.menu.clock.25extclock=25 MHz ext. clock (overclocked)
#avrea.menu.clock.25extclock.build.f_cpu=25000000L
#avrea.menu.clock.25extclock.build.speed=25
#avrea.menu.clock.25extclock.build.clocksource=2
#avrea.menu.clock.28extclock=28 MHz ext. clock (overclocked)
#avrea.menu.clock.28extclock.build.f_cpu=28000000L
#avrea.menu.clock.28extclock.build.speed=28
#avrea.menu.clock.28extclock.build.clocksource=2
#avrea.menu.clock.30extclock=30 MHz ext. clock (overclocked)
#avrea.menu.clock.30extclock.build.f_cpu=30000000L
#avrea.menu.clock.30extclock.build.speed=30
#avrea.menu.clock.30extclock.build.clocksource=2
#avrea.menu.clock.32extclock=32 MHz ext. clock (overclocked)
#avrea.menu.clock.32extclock.build.f_cpu=32000000L
#avrea.menu.clock.32extclock.build.speed=32
#avrea.menu.clock.32extclock.build.clocksource=2
#avrea.menu.clock.36extclock=36 MHz ext. clock (overclocked)
#avrea.menu.clock.36extclock.build.f_cpu=36000000L
#avrea.menu.clock.36extclock.build.speed=36
#avrea.menu.clock.36extclock.build.clocksource=2
#avrea.menu.clock.40extclock=40 MHz ext. clock (overclocked)
#avrea.menu.clock.40extclock.build.f_cpu=40000000L
#avrea.menu.clock.40extclock.build.speed=40
#avrea.menu.clock.40extclock.build.clocksource=2
#avrea.menu.clock.48extclock=48 MHz ext. clock (WAY overclocked)
#avrea.menu.clock.48extclock.build.f_cpu=48000000L
#avrea.menu.clock.48extclock.build.speed=48
#avrea.menu.clock.48extclock.build.clocksource=2

