SpenceKonde/DxCore/megaavr/boards.txt
#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
# AVR-DB submenu options                     #
#____________________________________________#
# Chip (memory and pincount)             #
#________________________________________#
avrdbopti.menu.chip.128DB28=AVR128DB28
avrdbopti.menu.chip.128DB28.build.mcu=avr128db28
avrdbopti.menu.chip.128DB28.bootloader.file=optiboot_dx128
avrdbopti.menu.chip.128DB28.upload.maximum_size=130560
avrdbopti.menu.chip.128DB28.upload.maximum_data_size=16384
avrdbopti.menu.chip.128DB28.build.variant=28pin-standard
avrdbopti.menu.chip.128DB32=AVR128DB32
avrdbopti.menu.chip.128DB32.build.mcu=avr128db32
avrdbopti.menu.chip.128DB32.bootloader.file=optiboot_dx128
avrdbopti.menu.chip.128DB32.upload.maximum_size=130560
avrdbopti.menu.chip.128DB32.upload.maximum_data_size=16384
avrdbopti.menu.chip.128DB32.build.variant=32pin-standard
avrdbopti.menu.chip.128DB48=AVR128DB48
avrdbopti.menu.chip.128DB48.build.mcu=avr128db48
avrdbopti.menu.chip.128DB48.bootloader.file=optiboot_dx128
avrdbopti.menu.chip.128DB48.upload.maximum_size=130560
avrdbopti.menu.chip.128DB48.upload.maximum_data_size=16384
avrdbopti.menu.chip.128DB48.build.variant=48pin-standard
avrdbopti.menu.chip.128DB64=AVR128DB64
avrdbopti.menu.chip.128DB64.build.mcu=avr128db64
avrdbopti.menu.chip.128DB64.bootloader.file=optiboot_dx128
avrdbopti.menu.chip.128DB64.upload.maximum_size=130560
avrdbopti.menu.chip.128DB64.upload.maximum_data_size=16384
avrdbopti.menu.chip.128DB64.build.variant=64pin-standard
avrdbopti.menu.chip.64DB28=AVR64DB28
avrdbopti.menu.chip.64DB28.build.mcu=avr64db28
avrdbopti.menu.chip.64DB28.bootloader.file=optiboot_dx64
avrdbopti.menu.chip.64DB28.upload.maximum_size=65024
avrdbopti.menu.chip.64DB28.upload.maximum_data_size=8192
avrdbopti.menu.chip.64DB28.build.variant=28pin-standard
avrdbopti.menu.chip.64DB32=AVR64DB32
avrdbopti.menu.chip.64DB32.build.mcu=avr64db32
avrdbopti.menu.chip.64DB32.bootloader.file=optiboot_dx64
avrdbopti.menu.chip.64DB32.upload.maximum_size=65024
avrdbopti.menu.chip.64DB32.upload.maximum_data_size=8192
avrdbopti.menu.chip.64DB32.build.variant=32pin-standard
avrdbopti.menu.chip.64DB48=AVR64DB48
avrdbopti.menu.chip.64DB48.build.mcu=avr64db48
avrdbopti.menu.chip.64DB48.bootloader.file=optiboot_dx64
avrdbopti.menu.chip.64DB48.upload.maximum_size=65024
avrdbopti.menu.chip.64DB48.upload.maximum_data_size=8192
avrdbopti.menu.chip.64DB48.build.variant=48pin-standard
avrdbopti.menu.chip.64DB64=AVR64DB64
avrdbopti.menu.chip.64DB64.build.mcu=avr64db64
avrdbopti.menu.chip.64DB64.bootloader.file=optiboot_dx64
avrdbopti.menu.chip.64DB64.upload.maximum_size=65024
avrdbopti.menu.chip.64DB64.upload.maximum_data_size=8192
avrdbopti.menu.chip.64DB64.build.variant=64pin-standard
avrdbopti.menu.chip.32DB28=AVR32DB28
avrdbopti.menu.chip.32DB28.build.mcu=avr32db28
avrdbopti.menu.chip.32DB28.bootloader.file=optiboot_dx32
avrdbopti.menu.chip.32DB28.upload.maximum_size=32256
avrdbopti.menu.chip.32DB28.upload.maximum_data_size=4096
avrdbopti.menu.chip.32DB28.build.variant=28pin-standard
avrdbopti.menu.chip.32DB32=AVR32DB32
avrdbopti.menu.chip.32DB32.build.mcu=avr32db32
avrdbopti.menu.chip.32DB32.bootloader.file=optiboot_dx32
avrdbopti.menu.chip.32DB32.upload.maximum_size=32256
avrdbopti.menu.chip.32DB32.upload.maximum_data_size=4096
avrdbopti.menu.chip.32DB32.build.variant=32pin-standard
avrdbopti.menu.chip.32DB48=AVR32DB48
avrdbopti.menu.chip.32DB48.build.mcu=avr32db48
avrdbopti.menu.chip.32DB48.bootloader.file=optiboot_dx32
avrdbopti.menu.chip.32DB48.upload.maximum_size=32256
avrdbopti.menu.chip.32DB48.upload.maximum_data_size=4096
avrdbopti.menu.chip.32DB48.build.variant=48pin-standard

#----------------------------------------#
# Clock speed and source options         #
#________________________________________#
avrdbopti.menu.clock.24internal=24 MHz internal
avrdbopti.menu.clock.24internal.build.f_cpu=24000000L
avrdbopti.menu.clock.24internal.build.speed=24
avrdbopti.menu.clock.24internal.build.clocksource=0
avrdbopti.menu.clock.20internal=20 MHz internal
avrdbopti.menu.clock.20internal.build.f_cpu=20000000L
avrdbopti.menu.clock.20internal.build.speed=20
avrdbopti.menu.clock.20internal.build.clocksource=0
avrdbopti.menu.clock.16internal=16 MHz internal
avrdbopti.menu.clock.16internal.build.f_cpu=16000000L
avrdbopti.menu.clock.16internal.build.speed=16
avrdbopti.menu.clock.16internal.build.clocksource=0
avrdbopti.menu.clock.12internal=12 MHz internal
avrdbopti.menu.clock.12internal.build.f_cpu=12000000L
avrdbopti.menu.clock.12internal.build.speed=12
avrdbopti.menu.clock.12internal.build.clocksource=0
avrdbopti.menu.clock.10internal=10 MHz internal
avrdbopti.menu.clock.10internal.build.f_cpu=10000000L
avrdbopti.menu.clock.10internal.build.speed=10
avrdbopti.menu.clock.10internal.build.clocksource=0
avrdbopti.menu.clock.8internal=8 MHz internal
avrdbopti.menu.clock.8internal.build.f_cpu=8000000L
avrdbopti.menu.clock.8internal.build.speed=8
avrdbopti.menu.clock.8internal.build.clocksource=0
avrdbopti.menu.clock.4internal=4 MHz internal
avrdbopti.menu.clock.4internal.build.f_cpu=4000000L
avrdbopti.menu.clock.4internal.build.speed=4
avrdbopti.menu.clock.4internal.build.clocksource=0
avrdbopti.menu.clock.1internal=1 MHz internal
avrdbopti.menu.clock.1internal.build.f_cpu=1000000L
avrdbopti.menu.clock.1internal.build.speed=1
avrdbopti.menu.clock.1internal.build.clocksource=0
avrdbopti.menu.clock.24crystal=24 MHz crystal
avrdbopti.menu.clock.24crystal.build.f_cpu=24000000L
avrdbopti.menu.clock.24crystal.build.speed=24
avrdbopti.menu.clock.24crystal.build.clocksource=1
avrdbopti.menu.clock.20crystal=20 MHz crystal
avrdbopti.menu.clock.20crystal.build.f_cpu=20000000L
avrdbopti.menu.clock.20crystal.build.speed=20
avrdbopti.menu.clock.20crystal.build.clocksource=1
avrdbopti.menu.clock.16crystal=16 MHz crystal
avrdbopti.menu.clock.16crystal.build.f_cpu=16000000L
avrdbopti.menu.clock.16crystal.build.speed=16
avrdbopti.menu.clock.16crystal.build.clocksource=1
avrdbopti.menu.clock.12crystal=12 MHz crystal
avrdbopti.menu.clock.12crystal.build.f_cpu=12000000L
avrdbopti.menu.clock.12crystal.build.speed=12
avrdbopti.menu.clock.12crystal.build.clocksource=1
avrdbopti.menu.clock.8crystal=8 MHz crystal
avrdbopti.menu.clock.8crystal.build.f_cpu=8000000L
avrdbopti.menu.clock.8crystal.build.speed=8
avrdbopti.menu.clock.8crystal.build.clocksource=1
avrdbopti.menu.clock.24extclock=24 MHz ext. clock
avrdbopti.menu.clock.24extclock.build.f_cpu=24000000L
avrdbopti.menu.clock.24extclock.build.speed=24
avrdbopti.menu.clock.24extclock.build.clocksource=2
avrdbopti.menu.clock.20extclock=20 MHz ext. clock
avrdbopti.menu.clock.20extclock.build.f_cpu=20000000L
avrdbopti.menu.clock.20extclock.build.speed=20
avrdbopti.menu.clock.20extclock.build.clocksource=2
avrdbopti.menu.clock.16extclock=16 MHz ext. clock
avrdbopti.menu.clock.16extclock.build.f_cpu=16000000L
avrdbopti.menu.clock.16extclock.build.speed=16
avrdbopti.menu.clock.16extclock.build.clocksource=2
avrdbopti.menu.clock.12extclock=12 MHz ext. clock
avrdbopti.menu.clock.12extclock.build.f_cpu=12000000L
avrdbopti.menu.clock.12extclock.build.speed=12
avrdbopti.menu.clock.12extclock.build.clocksource=2
avrdbopti.menu.clock.8extclock=8 MHz ext. clock
avrdbopti.menu.clock.8extclock.build.f_cpu=8000000L
avrdbopti.menu.clock.8extclock.build.speed=8
avrdbopti.menu.clock.8extclock.build.clocksource=2
avrdbopti.menu.clock.28internal=28 MHz internal (overclocked)
avrdbopti.menu.clock.28internal.build.f_cpu=28000000L
avrdbopti.menu.clock.28internal.build.speed=28
avrdbopti.menu.clock.28internal.build.clocksource=0
avrdbopti.menu.clock.32internal=32 MHz internal (overclocked)
avrdbopti.menu.clock.32internal.build.f_cpu=32000000L
avrdbopti.menu.clock.32internal.build.speed=32
avrdbopti.menu.clock.32internal.build.clocksource=0
avrdbopti.menu.clock.25crystal=25 MHz crystal (slightly overclocked)
avrdbopti.menu.clock.25crystal.build.f_cpu=25000000L
avrdbopti.menu.clock.25crystal.build.speed=25
avrdbopti.menu.clock.25crystal.build.clocksource=1
avrdbopti.menu.clock.28crystal=28 MHz crystal (overclocked)
avrdbopti.menu.clock.28crystal.build.f_cpu=28000000L
avrdbopti.menu.clock.28crystal.build.speed=28
avrdbopti.menu.clock.28crystal.build.clocksource=1
avrdbopti.menu.clock.30crystal=30 MHz ext. clock (overclocked)
avrdbopti.menu.clock.30crystal.build.f_cpu=30000000L
avrdbopti.menu.clock.30crystal.build.speed=30
avrdbopti.menu.clock.30crystal.build.clocksource=1
avrdbopti.menu.clock.32crystal=32 MHz crystal (overclocked)
avrdbopti.menu.clock.32crystal.build.f_cpu=32000000L
avrdbopti.menu.clock.32crystal.build.speed=32
avrdbopti.menu.clock.32crystal.build.clocksource=1
avrdbopti.menu.clock.36crystal=36 MHz crystal (overclocked)
avrdbopti.menu.clock.36crystal.build.f_cpu=36000000L
avrdbopti.menu.clock.36crystal.build.speed=36
avrdbopti.menu.clock.36crystal.build.clocksource=1
avrdbopti.menu.clock.40crystal=40 MHz crystal (overclocked)
avrdbopti.menu.clock.40crystal.build.f_cpu=40000000L
avrdbopti.menu.clock.40crystal.build.speed=40
avrdbopti.menu.clock.40crystal.build.clocksource=1
avrdbopti.menu.clock.25extclock=25 MHz ext. clock (slightly overclocked)
avrdbopti.menu.clock.25extclock.build.f_cpu=25000000L
avrdbopti.menu.clock.25extclock.build.speed=25
avrdbopti.menu.clock.25extclock.build.clocksource=2
avrdbopti.menu.clock.28extclock=28 MHz ext. clock (overclocked)
avrdbopti.menu.clock.28extclock.build.f_cpu=28000000L
avrdbopti.menu.clock.28extclock.build.speed=28
avrdbopti.menu.clock.28extclock.build.clocksource=2
avrdbopti.menu.clock.30extclock=30 MHz ext. clock (overclocked)
avrdbopti.menu.clock.30extclock.build.f_cpu=30000000L
avrdbopti.menu.clock.30extclock.build.speed=30
avrdbopti.menu.clock.30extclock.build.clocksource=2
avrdbopti.menu.clock.32extclock=32 MHz ext. clock (overclocked)
avrdbopti.menu.clock.32extclock.build.f_cpu=32000000L
avrdbopti.menu.clock.32extclock.build.speed=32
avrdbopti.menu.clock.32extclock.build.clocksource=2
avrdbopti.menu.clock.36extclock=36 MHz ext. clock (overclocked)
avrdbopti.menu.clock.36extclock.build.f_cpu=36000000L
avrdbopti.menu.clock.36extclock.build.speed=36
avrdbopti.menu.clock.36extclock.build.clocksource=2
avrdbopti.menu.clock.40extclock=40 MHz ext. clock (overclocked)
avrdbopti.menu.clock.40extclock.build.f_cpu=40000000L
avrdbopti.menu.clock.40extclock.build.speed=40
avrdbopti.menu.clock.40extclock.build.clocksource=2
avrdbopti.menu.clock.48extclock=48 MHz ext. clock (WAY overclocked)
avrdbopti.menu.clock.48extclock.build.f_cpu=48000000L
avrdbopti.menu.clock.48extclock.build.speed=48
avrdbopti.menu.clock.48extclock.build.clocksource=2

