SpenceKonde/DxCore/megaavr/boards.txt
#----------------------------------------#
# BrownOut detection (BOD) options       #
#________________________________________#
#avrddopti.menu.bodvoltage.1v9=1.9V
#avrddopti.menu.bodvoltage.1v9.bootloader.bodlevbits=000
#avrddopti.menu.bodvoltage.2v45=2.45V
#avrddopti.menu.bodvoltage.2v45.bootloader.bodlevbits=001
#avrddopti.menu.bodvoltage.2v70=2.70V
#avrddopti.menu.bodvoltage.2v70.bootloader.bodlevbits=010
#avrddopti.menu.bodvoltage.2v85=2.85V
#avrddopti.menu.bodvoltage.2v85.bootloader.bodlevbits=011
#avrddopti.menu.bodmode.disabled=Disabled/Disabled
#avrddopti.menu.bodmode.enabled=Enabled/Enabled
#avrddopti.menu.bodmode.ensampfast=Enabled/Sampled (128 Hz)
#avrddopti.menu.bodmode.ensampslow=Enabled/Sampled (32 Hz)
#avrddopti.menu.bodmode.sampledfast=Sampled/Sampled (128 Hz)
#avrddopti.menu.bodmode.sampledslow=Sampled/Sampled (32 Hz)
#avrddopti.menu.bodmode.sampdisfast=Sampled/Disabled (128 Hz)
#avrddopti.menu.bodmode.sampdisslow=Sampled/Disabled (32 Hz)
#avrddopti.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
#avrddopti.menu.bodmode.disabled.bootloader.BODCFG=0x00
#avrddopti.menu.bodmode.enabled.bootloader.bodmodebits=00101
#avrddopti.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
#avrddopti.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
#avrddopti.menu.bodmode.samplefast.bootloader.bodmodebits=01010
#avrddopti.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
#avrddopti.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
#avrddopti.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
#avrddopti.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

#----------------------------------------#
# Reset pin as INPUT, UPDI as I/O        #
#________________________________________#
#avrddopti.menu.resetupdipinsopti.reset=Reset & UPDI
#avrddopti.menu.resetupdipinsopti.reset.bootloader.resetpinbits=11
#avrddopti.menu.resetupdipinsopti.input=Input & UPDI (no reset to enter optiboot)
#avrddopti.menu.resetupdipinsopti.input.bootloader.resetpinbits=10
#avrddopti.menu.resetupdipinsopti.reset=Reset & GPIO (HV pulse RST for UPDI)
#avrddopti.menu.resetupdipinsopti.reset.bootloader.resetpinbits=01
#avrddopti.menu.resetupdipinsopti.input=Input & GPIO (no reset, HV pulse for UPDI)
#avrddopti.menu.resetupdipinsopti.input.bootloader.resetpinbits=00

#----------------------------------------#
# millis/micros timing source            #
#________________________________________#
#avrddopti.menu.millis.tcbhighest=TCB2 on 28/32pin else TCB1 (recommended)
#avrddopti.menu.millis.disabled=Disabled (delay() only)
#avrddopti.menu.millis.tcb0=TCB0
#avrddopti.menu.millis.tcb1=TCB1 (same as first option on 14/20 pins)
##avrddopti.menu.millis.rtc=RTC (no micros)
##avrddopti.menu.millis.rtcxtal=RTC w/w32.768 kHz ext. xtal no micros
##avrddopti.menu.millis.rtcxosc=RTC w/w32.768 kHz ext. osc no micros
#avrddopti.menu.millis.tcb0.build.millistimer={build.highestcb}
#avrddopti.menu.millis.tcb1.build.millistimer=B0
#avrddopti.menu.millis.tcb2.build.millistimer=B1
#avrddopti.menu.millis.tca0.build.millistimer=A0
##avrddopti.menu.millis.tcd0.build.millistimer=D0
##avrddopti.menu.millis.rtc.build.millistimer=RTC
##avrddopti.menu.millis.rtcxtal.build.millistimer=RTC_XTAL
##avrddopti.menu.millis.rtcxosc.build.millistimer=RTC_XOSC
#avrddopti.menu.millis.disabled.build.millistimer=NONE

#----------------------------------------#
# printf() version options               #
#________________________________________#
#avrddopti.menu.printf.default=Default, 1.5k flash, no floats
#avrddopti.menu.printf.full=Full, 2.6k, prints floats
#avrddopti.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
#avrddopti.menu.printf.full.build.printfabr=.pfF
#avrddopti.menu.printf.minimal=Minimal, 1.1k flash used
#avrddopti.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
#avrddopti.menu.printf.minimal.build.printfabr=.pfM

#----------------------------------------#
# MVIO                                   #
#________________________________________#
#avrddopti.menu.mvio.enabled=Enabled
#avrddopti.menu.mvio.enabled.bootloader.mviobits=01
#avrddopti.menu.mvio.disabled=Disabled
#avrddopti.menu.mvio.disabled.bootloader.mviobits=10

#----------------------------------------#
# Startup time options                   #
#________________________________________#
#avrddopti.menu.startuptime.8=8ms
#avrddopti.menu.startuptime.0=0ms
#avrddopti.menu.startuptime.1=1ms
#avrddopti.menu.startuptime.2=2ms
#avrddopti.menu.startuptime.4=4ms
#avrddopti.menu.startuptime.16=16ms
#avrddopti.menu.startuptime.32=32ms
#avrddopti.menu.startuptime.64=64ms
#avrddopti.menu.startuptime.0.bootloader.sutbits=000
#avrddopti.menu.startuptime.1.bootloader.sutbits=001
#avrddopti.menu.startuptime.2.bootloader.sutbits=010
#avrddopti.menu.startuptime.4.bootloader.sutbits=011
#avrddopti.menu.startuptime.8.bootloader.sutbits=100
#avrddopti.menu.startuptime.16.bootloader.sutbits=101
#avrddopti.menu.startuptime.32.bootloader.sutbits=110
#avrddopti.menu.startuptime.64.bootloader.sutbits=111

#----------------------------------------#
# Optiboot upload timeout                #
#________________________________________#
#avrddopti.menu.timeout.1sec=1 second (for use w/autoreset)
#avrddopti.menu.timeout.1sec.bootloader.timeout=
#avrddopti.menu.timeout.8sec=8 second (for use w/out autoreset)
#avrddopti.menu.timeout.8sec.bootloader.timeout=_8sec

#----------------------------------------#
# Optiboot serial port                   #
# Lots of options here....               #
#________________________________________#



##########################################################################
#                                                                        #
#   ###  #     # ####      #####   ###           ###          #          #
#  #   # #     # #   #     #      #   #         #   #        ###  ##     #
#  #####  #   #  ####  ### ####   #####         #   #  ###    #          #
#  #   #   # #   # #       #      #   #         #   #  #  #   #   ##     #
#  #   #    #    #  #      #####  #   #          ###   ###    #   ##     #
#______________________________________________________#_________________#
#                                        #             #
# We seriously don't know enough for     #
# this level of speculation.             #
#________________________________________#



