SpenceKonde/DxCore/megaavr/boards.txt
###################################################################################
#                                                                                 #
#  ###       ####                                                    ####  ####   #
# #   # #### #   # #   #  #  #  #  ###      #  #  ##  #  #  ###      #   # #   #  #
# #####   #  #   # #   #  #  ## # #   #     ## # #  # ## # #   #     #   # ####   #
# #   #  #   #   # #   #  #  # ## #   #     # ## #### # ## #   #     #   # #   #  #
# #   # #### ####   ###   #  #  #  ###      #  # #  # #  #  ###      ####  ####   #
#_________________________________________________________________________________#
#                                        #
# Parameters and defaults for DB parts   #
# The Azduino Nano DB is an approximately#
# Nano-shaped dev-board (it is not pin
# compatible because the nano pin mapping
# is terribad) that uses Optiboot
#________________________________________#
azduinoboard.build.board=avrdb
azduinoboard.build.core=dxcore
azduinoboard.build.text_section_start=.text=0x200
azduinoboard.build.extra_flags=
azduinoboard.build.export_merged_output=true
azduinoboard.build.printf=
azduinoboard.bootloader.avrdudestring=-Uflash:w:{runtime.platform.path}/bootloaders/hex/{bootloader.file}_ser0_alt.hex:i
azduinoboard.bootloader.pymcuprogstring=-f{runtime.platform.path}/bootloaders/hex/{bootloader.file}_ser0_alt.hex -a write
#----------------------------------------#
# Bootloading parameters and fuses       #
#________________________________________#
azduinoboard.bootloader.tool=avrdude
azduinoboard.bootloader.WDTCFG=0x00
azduinoboard.bootloader.BODCFG={bootloader.bodlevbits}{bootloader.bodmodebits}
azduinoboard.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}00
azduinoboard.bootloader.SYSCFG1=0b000{bootloader.mviobits}{bootloader.sutbits}
azduinoboard.bootloader.CODESIZE=0x00
azduinoboard.bootloader.BOOTSIZE=0x01
#----------------------------------------#
# Upload parameters for Optiboot         #
#________________________________________#
azduinoboard.upload.tool=avrdude
azduinoboard.upload.protocol=arduino
azduinoboard.upload.extra_params=-D
azduinoboard.upload.speed=115200
#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
azduinoboard.build.mcupostfix=opti
azduinoboard.build.printfabr=
azduinoboard.build.appspmabr=

#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
# AVR-DB submenu options                     #
#____________________________________________#
# Chip (memory and pincount)             #
#________________________________________#
azduinoboard.menu.board.NanoDB_A=Azduino Nano DB (Rev. A))
azduinoboard.menu.board.NanoDB_A.build.mcu=avr128db32
azduinoboard.menu.board.NanoDB_A.bootloader.file=optiboot_dx128
azduinoboard.menu.board.NanoDB_A.upload.maximum_size=130560
azduinoboard.menu.board.NanoDB_A.upload.maximum_data_size=16384
azduinoboard.menu.board.NanoDB_A.bootloader.portname=Serial0
azduinoboard.menu.board.NanoDB_A.bootloader.portswap=1
azduinoboard.menu.board.NanoDB_A.build.extra_flags=-DSERIAL_PORT_BOOT=Serial0 -DSERIAL_PORT_BOOT_PORTMUX=1 -DXTAL_PINS_HARDWIRED -DHARDWIRE_INPUT_ONLY=PIN_PA5 -DLED_BUILTIN2=PIN_PA6 -DUSING_OPTIBOOT
azduinoboard.menu.board.NanoDB_A.build.variant=32pin-standard
#azduinoboard.menu.board.NanoDB_B=Azduino Nano DB (Rev. B or A w/resistor mod)
#azduinoboard.menu.board.NanoDB_B.build.mcu=avr128db32
#azduinoboard.menu.board.NanoDB_B.bootloader.file=optiboot_dx128
#azduinoboard.menu.board.NanoDB_B.upload.maximum_size=130560
#azduinoboard.menu.board.NanoDB_B.upload.maximum_data_size=16384
#azduinoboard.menu.board.NanoDB_B.bootloader.portname=Serial0
#azduinoboard.menu.board.NanoDB_B.bootloader.portswap=1
azduinoboard.menu.board.NanoDBPlus.build.extra_flags=-DSERIAL_PORT_BOOT=Serial0 -DSERIAL_PORT_BOOT_PORTMUX=1 -DXTAL_PINS_HARDWIRED -DLED_BUILTIN2=PIN_PF0 -DLED_BUILTIN3=PIN_PF1 -DUSING_OPTIBOOT
azduinoboard.menu.board.NanoDBPlus.build.variant=32pin-standard
azduinoboard.menu.board.NanoDBPlus=Azduino Nano DB++, Light Controller 2.1+
azduinoboard.menu.board.NanoDBPlus.build.mcu=avr128db48
azduinoboard.menu.board.NanoDBPlus.bootloader.file=optiboot_dx128
azduinoboard.menu.board.NanoDBPlus.upload.maximum_size=130560
azduinoboard.menu.board.NanoDBPlus.upload.maximum_data_size=16384
azduinoboard.menu.board.NanoDBPlus.build.variant=48pin-standard

#----------------------------------------#
# Clock speed and source options         #
# For the Azduino products we drop clock #
# speeds we think are unlikely to see    #
# use. These ship with 16-40 MHz xtal    #
#________________________________________#
azduinoboard.menu.clock.24internal=24 MHz internal
azduinoboard.menu.clock.24internal.build.f_cpu=24000000L
azduinoboard.menu.clock.24internal.build.speed=24
azduinoboard.menu.clock.24internal.build.clocksource=0
azduinoboard.menu.clock.20internal=20 MHz internal
azduinoboard.menu.clock.20internal.build.f_cpu=20000000L
azduinoboard.menu.clock.20internal.build.speed=20
azduinoboard.menu.clock.20internal.build.clocksource=0
azduinoboard.menu.clock.16internal=16 MHz internal
azduinoboard.menu.clock.16internal.build.f_cpu=16000000L
azduinoboard.menu.clock.16internal.build.speed=16
azduinoboard.menu.clock.16internal.build.clocksource=0
azduinoboard.menu.clock.24crystal=24 MHz crystal
azduinoboard.menu.clock.24crystal.build.f_cpu=24000000L
azduinoboard.menu.clock.24crystal.build.speed=24
azduinoboard.menu.clock.24crystal.build.clocksource=1
azduinoboard.menu.clock.20crystal=20 MHz crystal
azduinoboard.menu.clock.20crystal.build.f_cpu=20000000L
azduinoboard.menu.clock.20crystal.build.speed=20
azduinoboard.menu.clock.20crystal.build.clocksource=1
azduinoboard.menu.clock.16crystal=16 MHz crystal
azduinoboard.menu.clock.16crystal.build.f_cpu=16000000L
azduinoboard.menu.clock.16crystal.build.speed=16
azduinoboard.menu.clock.16crystal.build.clocksource=1
azduinoboard.menu.clock.32crystal=32 MHz crystal (overclocked)
azduinoboard.menu.clock.32crystal.build.f_cpu=32000000L
azduinoboard.menu.clock.32crystal.build.speed=32
azduinoboard.menu.clock.32crystal.build.clocksource=1
azduinoboard.menu.clock.40crystal=40 MHz crystal (overclocked)
azduinoboard.menu.clock.40crystal.build.f_cpu=40000000L
azduinoboard.menu.clock.40crystal.build.speed=40
azduinoboard.menu.clock.40crystal.build.clocksource=1
azduinoboard.menu.clock.32internal=32 MHz internal (overclocked)
azduinoboard.menu.clock.32internal.build.f_cpu=32000000L
azduinoboard.menu.clock.32internal.build.speed=32
azduinoboard.menu.clock.32internal.build.clocksource=0
azduinoboard.menu.clock.4internal=4 MHz internal
azduinoboard.menu.clock.4internal.build.f_cpu=4000000L
azduinoboard.menu.clock.4internal.build.speed=4
azduinoboard.menu.clock.4internal.build.clocksource=0
azduinoboard.menu.clock.1internal=1 MHz internal
azduinoboard.menu.clock.1internal.build.f_cpu=1000000L
azduinoboard.menu.clock.1internal.build.speed=1
azduinoboard.menu.clock.1internal.build.clocksource=0
azduinoboard.menu.clock.30crystal=30 MHz crystal (overclocked)
azduinoboard.menu.clock.30crystal.build.f_cpu=30000000L
azduinoboard.menu.clock.30crystal.build.speed=30
azduinoboard.menu.clock.30crystal.build.clocksource=1

